src/InformationRegisters/ШтрихкодыДесмы/ШтрихкодыДесмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыДесмы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ОбработанТШК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Комплектовщик</name>
    <type>
      <types>CatalogRef.Комплектовщики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>EnumRef.ПроцессНаДесме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ШтрихкодыДесмы/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Комплектовщик, Знач Процесс, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Комплектовщик = Комплектовщик;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Комплектовщик, Знач Процесс, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Комплектовщик = Комплектовщик;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах комплектовщика.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
Процедура УдалитьШтрихкодыКомплектовщика(Знач Комплектовщик, Знач Процесс) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.Отбор.Комплектовщик.Установить(Комплектовщик);
    НаборЗаписей.Отбор.Процесс.Установить(Процесс);

    НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
